balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F6014.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADPCFG" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="ADPCFG" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCFG" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PCFG" edc:nzwidth="0x10"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PCFG0" edc:desc="" edc:mask="0x1" edc:name="PCFG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG1" edc:desc="" edc:mask="0x1" edc:name="PCFG1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG2" edc:desc="" edc:mask="0x1" edc:name="PCFG2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG3" edc:desc="" edc:mask="0x1" edc:name="PCFG3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG4" edc:desc="" edc:mask="0x1" edc:name="PCFG4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG5" edc:desc="" edc:mask="0x1" edc:name="PCFG5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG6" edc:desc="" edc:mask="0x1" edc:name="PCFG6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG7" edc:desc="" edc:mask="0x1" edc:name="PCFG7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG8" edc:desc="" edc:mask="0x1" edc:name="PCFG8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG9" edc:desc="" edc:mask="0x1" edc:name="PCFG9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG10" edc:desc="" edc:mask="0x1" edc:name="PCFG10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG11" edc:desc="" edc:mask="0x1" edc:name="PCFG11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG12" edc:desc="" edc:mask="0x1" edc:name="PCFG12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG13" edc:desc="" edc:mask="0x1" edc:name="PCFG13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG14" edc:desc="" edc:mask="0x1" edc:name="PCFG14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG15" edc:desc="" edc:mask="0x1" edc:name="PCFG15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADCSSL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="ADCSSL" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CSSL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CSSL" edc:nzwidth="0x10"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CSSL0" edc:desc="" edc:mask="0x1" edc:name="CSSL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL1" edc:desc="" edc:mask="0x1" edc:name="CSSL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL2" edc:desc="" edc:mask="0x1" edc:name="CSSL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL3" edc:desc="" edc:mask="0x1" edc:name="CSSL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL4" edc:desc="" edc:mask="0x1" edc:name="CSSL4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL5" edc:desc="" edc:mask="0x1" edc:name="CSSL5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL6" edc:desc="" edc:mask="0x1" edc:name="CSSL6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL7" edc:desc="" edc:mask="0x1" edc:name="CSSL7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL8" edc:desc="" edc:mask="0x1" edc:name="CSSL8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL9" edc:desc="" edc:mask="0x1" edc:name="CSSL9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL10" edc:desc="" edc:mask="0x1" edc:name="CSSL10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL11" edc:desc="" edc:mask="0x1" edc:name="CSSL11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL12" edc:desc="" edc:mask="0x1" edc:name="CSSL12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL13" edc:desc="" edc:mask="0x1" edc:name="CSSL13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL14" edc:desc="" edc:mask="0x1" edc:name="CSSL14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSSL15" edc:desc="" edc:mask="0x1" edc:name="CSSL15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="20"/>
        <edc:SFRDef edc:access="nnnn-nn-nn------" edc:cname="TRISA" edc:desc="" edc:impl="0xf6c0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111-11-11------" edc:name="TRISA" edc:nzwidth="0x10" edc:por="1111-11-11------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="TRISA6" edc:desc="" edc:mask="0x1" edc:name="TRISA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA7" edc:desc="" edc:mask="0x1" edc:name="TRISA7" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TRISA9" edc:desc="" edc:mask="0x1" edc:name="TRISA9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA10" edc:desc="" edc:mask="0x1" edc:name="TRISA10" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TRISA12" edc:desc="" edc:mask="0x1" edc:name="TRISA12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA13" edc:desc="" edc:mask="0x1" edc:name="TRISA13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA14" edc:desc="" edc:mask="0x1" edc:name="TRISA14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA15" edc:desc="" edc:mask="0x1" edc:name="TRISA15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISA" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TRISA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nn-nn------" edc:cname="PORTA" edc:desc="" edc:impl="0xf6c0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuu-uu-uu------" edc:name="PORTA" edc:nzwidth="0x10" edc:por="xxxx-xx-xx------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="RA6" edc:desc="" edc:mask="0x1" edc:name="RA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA7" edc:desc="" edc:mask="0x1" edc:name="RA7" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RA9" edc:desc="" edc:mask="0x1" edc:name="RA9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA10" edc:desc="" edc:mask="0x1" edc:name="RA10" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RA12" edc:desc="" edc:mask="0x1" edc:name="RA12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA13" edc:desc="" edc:mask="0x1" edc:name="RA13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA14" edc:desc="" edc:mask="0x1" edc:name="RA14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA15" edc:desc="" edc:mask="0x1" edc:name="RA15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RA" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="RA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nn-nn------" edc:cname="LATA" edc:desc="" edc:impl="0xf6c0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuu-uu-uu------" edc:name="LATA" edc:nzwidth="0x10" edc:por="0000-00-00------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="LATA6" edc:desc="" edc:mask="0x1" edc:name="LATA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA7" edc:desc="" edc:mask="0x1" edc:name="LATA7" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LATA9" edc:desc="" edc:mask="0x1" edc:name="LATA9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA10" edc:desc="" edc:mask="0x1" edc:name="LATA10" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LATA12" edc:desc="" edc:mask="0x1" edc:name="LATA12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA13" edc:desc="" edc:mask="0x1" edc:name="LATA13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA14" edc:desc="" edc:mask="0x1" edc:name="LATA14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA15" edc:desc="" edc:mask="0x1" edc:name="LATA15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATA" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="LATA" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="TRISB" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111111111111" edc:name="TRISB" edc:nzwidth="0x10" edc:por="1111111111111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISB0" edc:desc="" edc:mask="0x1" edc:name="TRISB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB1" edc:desc="" edc:mask="0x1" edc:name="TRISB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB2" edc:desc="" edc:mask="0x1" edc:name="TRISB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB3" edc:desc="" edc:mask="0x1" edc:name="TRISB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB4" edc:desc="" edc:mask="0x1" edc:name="TRISB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB5" edc:desc="" edc:mask="0x1" edc:name="TRISB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB6" edc:desc="" edc:mask="0x1" edc:name="TRISB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB7" edc:desc="" edc:mask="0x1" edc:name="TRISB7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB8" edc:desc="" edc:mask="0x1" edc:name="TRISB8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB9" edc:desc="" edc:mask="0x1" edc:name="TRISB9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB10" edc:desc="" edc:mask="0x1" edc:name="TRISB10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB11" edc:desc="" edc:mask="0x1" edc:name="TRISB11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB12" edc:desc="" edc:mask="0x1" edc:name="TRISB12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB13" edc:desc="" edc:mask="0x1" edc:name="TRISB13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB14" edc:desc="" edc:mask="0x1" edc:name="TRISB14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISB15" edc:desc="" edc:mask="0x1" edc:name="TRISB15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISB" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TRISB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PORTB" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="PORTB" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB2" edc:desc="" edc:mask="0x1" edc:name="RB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB3" edc:desc="" edc:mask="0x1" edc:name="RB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4" edc:desc="" edc:mask="0x1" edc:name="RB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5" edc:desc="" edc:mask="0x1" edc:name="RB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6" edc:desc="" edc:mask="0x1" edc:name="RB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7" edc:desc="" edc:mask="0x1" edc:name="RB7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB8" edc:desc="" edc:mask="0x1" edc:name="RB8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB9" edc:desc="" edc:mask="0x1" edc:name="RB9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB10" edc:desc="" edc:mask="0x1" edc:name="RB10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB11" edc:desc="" edc:mask="0x1" edc:name="RB11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB12" edc:desc="" edc:mask="0x1" edc:name="RB12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB13" edc:desc="" edc:mask="0x1" edc:name="RB13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB14" edc:desc="" edc:mask="0x1" edc:name="RB14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB15" edc:desc="" edc:mask="0x1" edc:name="RB15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RB" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="RB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LATB" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LATB" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATB0" edc:desc="" edc:mask="0x1" edc:name="LATB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB1" edc:desc="" edc:mask="0x1" edc:name="LATB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB2" edc:desc="" edc:mask="0x1" edc:name="LATB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB3" edc:desc="" edc:mask="0x1" edc:name="LATB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB4" edc:desc="" edc:mask="0x1" edc:name="LATB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB5" edc:desc="" edc:mask="0x1" edc:name="LATB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB6" edc:desc="" edc:mask="0x1" edc:name="LATB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB7" edc:desc="" edc:mask="0x1" edc:name="LATB7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB8" edc:desc="" edc:mask="0x1" edc:name="LATB8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB9" edc:desc="" edc:mask="0x1" edc:name="LATB9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB10" edc:desc="" edc:mask="0x1" edc:name="LATB10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB11" edc:desc="" edc:mask="0x1" edc:name="LATB11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB12" edc:desc="" edc:mask="0x1" edc:name="LATB12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB13" edc:desc="" edc:mask="0x1" edc:name="LATB13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB14" edc:desc="" edc:mask="0x1" edc:name="LATB14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB15" edc:desc="" edc:mask="0x1" edc:name="LATB15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATB" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="LATB" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn--------nnnn-" edc:cname="TRISC" edc:desc="" edc:impl="0xe01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="111--------1111-" edc:name="TRISC" edc:nzwidth="0x10" edc:por="111--------1111-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TRISC1" edc:desc="" edc:mask="0x1" edc:name="TRISC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC2" edc:desc="" edc:mask="0x1" edc:name="TRISC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC3" edc:desc="" edc:mask="0x1" edc:name="TRISC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC4" edc:desc="" edc:mask="0x1" edc:name="TRISC4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="TRISC13" edc:desc="" edc:mask="0x1" edc:name="TRISC13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC14" edc:desc="" edc:mask="0x1" edc:name="TRISC14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC15" edc:desc="" edc:mask="0x1" edc:name="TRISC15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISC" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TRISC" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn--------nnnn-" edc:cname="PORTC" edc:desc="" edc:impl="0xe01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu--------uuuu-" edc:name="PORTC" edc:nzwidth="0x10" edc:por="xxx--------xxxx-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RC1" edc:desc="" edc:mask="0x1" edc:name="RC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2" edc:desc="" edc:mask="0x1" edc:name="RC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3" edc:desc="" edc:mask="0x1" edc:name="RC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4" edc:desc="" edc:mask="0x1" edc:name="RC4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="RC13" edc:desc="" edc:mask="0x1" edc:name="RC13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC14" edc:desc="" edc:mask="0x1" edc:name="RC14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC15" edc:desc="" edc:mask="0x1" edc:name="RC15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RC" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="RC" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
