balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F6014.PIC
        <edc:SFRDef edc:access="ccrrrrrrnnnnnnnn" edc:cname="C2INTF" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C2INTF" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0IF" edc:desc="" edc:mask="0x1" edc:name="RXB0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1IF" edc:desc="" edc:mask="0x1" edc:name="RXB1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0IF" edc:desc="" edc:mask="0x1" edc:name="TXB0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1IF" edc:desc="" edc:mask="0x1" edc:name="TXB1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2IF" edc:desc="" edc:mask="0x1" edc:name="TXB2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERRIF" edc:desc="" edc:mask="0x1" edc:name="ERRIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKIF" edc:desc="" edc:mask="0x1" edc:name="WAKIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRXIF" edc:desc="" edc:mask="0x1" edc:name="IRXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EWARN" edc:desc="" edc:mask="0x1" edc:name="EWARN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXWARN" edc:desc="" edc:mask="0x1" edc:name="RXWARN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXWARN" edc:desc="" edc:mask="0x1" edc:name="TXWARN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXBP" edc:desc="" edc:mask="0x1" edc:name="RXBP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBP" edc:desc="" edc:mask="0x1" edc:name="TXBP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBO" edc:desc="" edc:mask="0x1" edc:name="TXBO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1OVFL" edc:desc="" edc:mask="0x1" edc:name="RXB1OVFL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0OVFL" edc:desc="" edc:mask="0x1" edc:name="RXB0OVFL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RX0IF" edc:desc="" edc:mask="0x1" edc:name="RX0IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RX1IF" edc:desc="" edc:mask="0x1" edc:name="RX1IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX0IF" edc:desc="" edc:mask="0x1" edc:name="TX0IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX1IF" edc:desc="" edc:mask="0x1" edc:name="TX1IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2IF" edc:desc="" edc:mask="0x1" edc:name="TX2IF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IVRIF" edc:desc="" edc:mask="0x1" edc:name="IVRIF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXWAR" edc:desc="" edc:mask="0x1" edc:name="RXWAR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXWAR" edc:desc="" edc:mask="0x1" edc:name="TXWAR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXEP" edc:desc="" edc:mask="0x1" edc:name="RXEP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEP" edc:desc="" edc:mask="0x1" edc:name="TXEP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RX1OVR" edc:desc="" edc:mask="0x1" edc:name="RX1OVR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX0OVR" edc:desc="" edc:mask="0x1" edc:name="RX0OVR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="C2INTE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="C2INTE" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0IE" edc:desc="" edc:mask="0x1" edc:name="RXB0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1IE" edc:desc="" edc:mask="0x1" edc:name="RXB1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0IE" edc:desc="" edc:mask="0x1" edc:name="TXB0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1IE" edc:desc="" edc:mask="0x1" edc:name="TXB1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2IE" edc:desc="" edc:mask="0x1" edc:name="TXB2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERRIE" edc:desc="" edc:mask="0x1" edc:name="ERRIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKIE" edc:desc="" edc:mask="0x1" edc:name="WAKIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRXIE" edc:desc="" edc:mask="0x1" edc:name="IRXIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RX0IE" edc:desc="" edc:mask="0x1" edc:name="RX0IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RX1IE" edc:desc="" edc:mask="0x1" edc:name="RX1IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX0IE" edc:desc="" edc:mask="0x1" edc:name="TX0IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX1IE" edc:desc="" edc:mask="0x1" edc:name="TX1IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2IE" edc:desc="" edc:mask="0x1" edc:name="TX2IE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IVRIE" edc:desc="" edc:mask="0x1" edc:name="IVRIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="C2EC" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C2EC" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="REC" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="REC" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TEC" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TEC" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="REC0" edc:desc="" edc:mask="0x1" edc:name="REC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REC1" edc:desc="" edc:mask="0x1" edc:name="REC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REC2" edc:desc="" edc:mask="0x1" edc:name="REC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REC3" edc:desc="" edc:mask="0x1" edc:name="REC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REC4" edc:desc="" edc:mask="0x1" edc:name="REC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REC5" edc:desc="" edc:mask="0x1" edc:name="REC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REC6" edc:desc="" edc:mask="0x1" edc:name="REC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REC7" edc:desc="" edc:mask="0x1" edc:name="REC7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TEC0" edc:desc="" edc:mask="0x1" edc:name="TEC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TEC1" edc:desc="" edc:mask="0x1" edc:name="TEC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TEC2" edc:desc="" edc:mask="0x1" edc:name="TEC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TEC3" edc:desc="" edc:mask="0x1" edc:name="TEC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TEC4" edc:desc="" edc:mask="0x1" edc:name="TEC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TEC5" edc:desc="" edc:mask="0x1" edc:name="TEC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TEC6" edc:desc="" edc:mask="0x1" edc:name="TEC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TEC7" edc:desc="" edc:mask="0x1" edc:name="TEC7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="740"/>
        <edc:SFRDef edc:access="nnrnnnnnnnnnnnnn" edc:cname="RCON" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu1uuuuuuu" edc:name="RCON" edc:nzwidth="0x10" edc:por="0000010100000011">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POR" edc:desc="" edc:mask="0x1" edc:name="POR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BOR" edc:desc="" edc:mask="0x1" edc:name="BOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IDLE" edc:desc="" edc:mask="0x1" edc:name="IDLE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEEP" edc:desc="" edc:mask="0x1" edc:name="SLEEP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WDTO" edc:desc="" edc:mask="0x1" edc:name="WDTO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWDTEN" edc:desc="" edc:mask="0x1" edc:name="SWDTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWR" edc:desc="" edc:mask="0x1" edc:name="SWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXTR" edc:desc="" edc:mask="0x1" edc:name="EXTR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LVDL" edc:desc="" edc:mask="0xf" edc:name="LVDL" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="LVDEN" edc:desc="" edc:mask="0x1" edc:name="LVDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BGST" edc:desc="" edc:mask="0x1" edc:name="BGST" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOPUWR" edc:desc="" edc:mask="0x1" edc:name="IOPUWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRAPR" edc:desc="" edc:mask="0x1" edc:name="TRAPR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="LVDL0" edc:desc="" edc:mask="0x1" edc:name="LVDL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LVDL1" edc:desc="" edc:mask="0x1" edc:name="LVDL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LVDL2" edc:desc="" edc:mask="0x1" edc:name="LVDL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LVDL3" edc:desc="" edc:mask="0x1" edc:name="LVDL3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
