balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F6014.PIC
        <edc:SFRDef edc:access="nnrrnnnnnnr-c-nn" edc:cname="OSCCON" edc:desc="" edc:impl="0xffeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-yyy-yyy000-0-00" edc:name="OSCCON" edc:nzwidth="0x10" edc:por="-yyy-yyy000-0-00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OSWEN" edc:desc="" edc:mask="0x1" edc:name="OSWEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LPOSCEN" edc:desc="" edc:mask="0x1" edc:name="LPOSCEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CF" edc:desc="" edc:mask="0x1" edc:name="CF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LOCK" edc:desc="" edc:mask="0x1" edc:name="LOCK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POST" edc:desc="" edc:mask="0x3" edc:name="POST" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="NOSC" edc:desc="" edc:mask="0x3" edc:name="NOSC" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TUN0" edc:desc="" edc:mask="0x1" edc:name="TUN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN1" edc:desc="" edc:mask="0x1" edc:name="TUN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COSC" edc:desc="" edc:mask="0x3" edc:name="COSC" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TUN2" edc:desc="" edc:mask="0x1" edc:name="TUN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TUN3" edc:desc="" edc:mask="0x1" edc:name="TUN3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="POST0" edc:desc="" edc:mask="0x1" edc:name="POST0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POST1" edc:desc="" edc:mask="0x1" edc:name="POST1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOSC0" edc:desc="" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOSC1" edc:desc="" edc:mask="0x1" edc:name="NOSC1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="COSC0" edc:desc="" edc:mask="0x1" edc:name="COSC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COSC1" edc:desc="" edc:mask="0x1" edc:name="COSC1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="28"/>
        <edc:SFRDef edc:access="nnn----n-nnnnnnn" edc:cname="NVMCON" edc:desc="" edc:impl="0xe17f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000----0-0000000" edc:name="NVMCON" edc:nzwidth="0x10" edc:por="000----0-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PROGOP" edc:desc="" edc:mask="0x7f" edc:name="PROGOP" edc:nzwidth="0x7"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TWRI" edc:desc="" edc:mask="0x1" edc:name="TWRI" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="WRERR" edc:desc="" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WREN" edc:desc="" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PROGOP0" edc:desc="" edc:mask="0x1" edc:name="PROGOP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP1" edc:desc="" edc:mask="0x1" edc:name="PROGOP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP2" edc:desc="" edc:mask="0x1" edc:name="PROGOP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP3" edc:desc="" edc:mask="0x1" edc:name="PROGOP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP4" edc:desc="" edc:mask="0x1" edc:name="PROGOP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP5" edc:desc="" edc:mask="0x1" edc:name="PROGOP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP6" edc:desc="" edc:mask="0x1" edc:name="PROGOP6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="NVMADR" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="NVMADR" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NVMADR" edc:desc="" edc:mask="0xffff" edc:name="NVMADR" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="NVMADRU" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="NVMADRU" edc:nzwidth="0x10" edc:por="--------xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NVMADR" edc:desc="" edc:mask="0xff" edc:name="NVMADR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------wwwwwwww" edc:cname="NVMKEY" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="NVMKEY" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="KEY" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="KEY" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:SFRDef edc:access="nnnnn--nnnnnnnnn" edc:cname="PMD1" edc:desc="" edc:impl="0xf9ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000--000000000" edc:name="PMD1" edc:nzwidth="0x10" edc:por="00000--000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCMD" edc:desc="" edc:mask="0x1" edc:name="ADCM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1MD" edc:desc="" edc:mask="0x1" edc:name="C1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2MD" edc:desc="" edc:mask="0x1" edc:name="C2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1MD" edc:desc="" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2MD" edc:desc="" edc:mask="0x1" edc:name="SPI2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1MD" edc:desc="" edc:mask="0x1" edc:name="U1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2MD" edc:desc="" edc:mask="0x1" edc:name="U2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2CMD" edc:desc="" edc:mask="0x1" edc:name="I2CMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DCIMD" edc:desc="" edc:mask="0x1" edc:name="DCIMD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="T1MD" edc:desc="" edc:mask="0x1" edc:name="T1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2MD" edc:desc="" edc:mask="0x1" edc:name="T2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3MD" edc:desc="" edc:mask="0x1" edc:name="T3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4MD" edc:desc="" edc:mask="0x1" edc:name="T4MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5MD" edc:desc="" edc:mask="0x1" edc:name="T5MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rw" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="PMD2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="PMD2" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OC1MD" edc:desc="" edc:mask="0x1" edc:name="OC1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC2MD" edc:desc="" edc:mask="0x1" edc:name="OC2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC3MD" edc:desc="" edc:mask="0x1" edc:name="OC3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC4MD" edc:desc="" edc:mask="0x1" edc:name="OC4MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC5MD" edc:desc="" edc:mask="0x1" edc:name="OC5MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC6MD" edc:desc="" edc:mask="0x1" edc:name="OC6MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC7MD" edc:desc="" edc:mask="0x1" edc:name="OC7MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC8MD" edc:desc="" edc:mask="0x1" edc:name="OC8MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC1MD" edc:desc="" edc:mask="0x1" edc:name="IC1MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC2MD" edc:desc="" edc:mask="0x1" edc:name="IC2MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC3MD" edc:desc="" edc:mask="0x1" edc:name="IC3MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC4MD" edc:desc="" edc:mask="0x1" edc:name="IC4MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC5MD" edc:desc="" edc:mask="0x1" edc:name="IC5MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC6MD" edc:desc="" edc:mask="0x1" edc:name="IC6MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC7MD" edc:desc="" edc:mask="0x1" edc:name="IC7MD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC8MD" edc:desc="" edc:mask="0x1" edc:name="IC8MD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rw" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:EmulatorSector edc:beginaddr="0xFD0000" edc:endaddr="0xfd0028" edc:regionid="emulreg"/>
      <edc:GPRDataSector edc:beginaddr="0x800" edc:endaddr="0x2800" edc:regionid="data"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <!--  Pin 1  -->
      <edc:VirtualPin edc:name="COFS"/>
      <edc:VirtualPin edc:name="RG15"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="T2CK"/>
      <edc:VirtualPin edc:name="RC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="T3CK"/>
      <edc:VirtualPin edc:name="RC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 4  -->
      <edc:VirtualPin edc:name="T4CK"/>
      <edc:VirtualPin edc:name="RC3"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 5  -->
      <edc:VirtualPin edc:name="T5CK"/>
      <edc:VirtualPin edc:name="RC4"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 6  -->
      <edc:VirtualPin edc:name="SCK2"/>
      <edc:VirtualPin edc:name="CN8"/>
      <edc:VirtualPin edc:name="RG6"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 7  -->
      <edc:VirtualPin edc:name="SDI2"/>
      <edc:VirtualPin edc:name="CN9"/>
      <edc:VirtualPin edc:name="RG7"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 8  -->
      <edc:VirtualPin edc:name="SDO2"/>
      <edc:VirtualPin edc:name="CN10"/>
      <edc:VirtualPin edc:name="RG8"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 9  -->
      <edc:VirtualPin edc:name="MCLR"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 10  -->
      <edc:VirtualPin edc:name="SS2"/>
      <edc:VirtualPin edc:name="CN11"/>
      <edc:VirtualPin edc:name="RG9"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 11  -->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 12  -->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 13  -->
      <edc:VirtualPin edc:name="INT1"/>
      <edc:VirtualPin edc:name="RA12"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 14  -->
      <edc:VirtualPin edc:name="INT2"/>
      <edc:VirtualPin edc:name="RA13"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 15  -->
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="CN7"/>
      <edc:VirtualPin edc:name="RB5"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 16  -->
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="CN6"/>
      <edc:VirtualPin edc:name="RB4"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 17  -->
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="CN5"/>
      <edc:VirtualPin edc:name="RB3"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 18  -->
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="SS1"/>
      <edc:VirtualPin edc:name="LVDIN"/>
      <edc:VirtualPin edc:name="CN4"/>
      <edc:VirtualPin edc:name="RB2"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 19  -->
      <edc:VirtualPin edc:name="PGC"/>
      <edc:VirtualPin edc:name="EMUC"/>
      <edc:VirtualPin edc:name="AN1"/>
      <edc:VirtualPin edc:name="CN3"/>
      <edc:VirtualPin edc:name="RB1"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 20  -->
      <edc:VirtualPin edc:name="PGD"/>
      <edc:VirtualPin edc:name="EMUD"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="CN2"/>
      <edc:VirtualPin edc:name="RB0"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 21  -->
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="OCFA"/>
      <edc:VirtualPin edc:name="RB6"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 22  -->
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="RB7"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 23  -->
      <edc:VirtualPin edc:name="VREF-"/>
      <edc:VirtualPin edc:name="RA9"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 24  -->
      <edc:VirtualPin edc:name="VREF+"/>
      <edc:VirtualPin edc:name="RA10"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 25  -->
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 26  -->
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 27  -->
      <edc:VirtualPin edc:name="AN8"/>
      <edc:VirtualPin edc:name="RB8"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 28  -->
      <edc:VirtualPin edc:name="AN9"/>
      <edc:VirtualPin edc:name="RB9"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 29  -->
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="RB10"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 30  -->
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="RB11"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 31  -->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 32  -->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 33  -->
      <edc:VirtualPin edc:name="AN12"/>
      <edc:VirtualPin edc:name="RB12"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 34  -->
      <edc:VirtualPin edc:name="AN13"/>
      <edc:VirtualPin edc:name="RB13"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 35  -->
      <edc:VirtualPin edc:name="AN14"/>
      <edc:VirtualPin edc:name="RB14"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 36  -->
      <edc:VirtualPin edc:name="AN15"/>
      <edc:VirtualPin edc:name="OCFB"/>
      <edc:VirtualPin edc:name="CN12"/>
      <edc:VirtualPin edc:name="RB15"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 37  -->
      <edc:VirtualPin edc:name="IC7"/>
      <edc:VirtualPin edc:name="CN20"/>
      <edc:VirtualPin edc:name="RD14"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 38  -->
      <edc:VirtualPin edc:name="IC8"/>
      <edc:VirtualPin edc:name="CN21"/>
      <edc:VirtualPin edc:name="RD15"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 39  -->
      <edc:VirtualPin edc:name="U2RX"/>
      <edc:VirtualPin edc:name="CN17"/>
      <edc:VirtualPin edc:name="RF4"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 40  -->
      <edc:VirtualPin edc:name="U2TX"/>
      <edc:VirtualPin edc:name="CN18"/>
      <edc:VirtualPin edc:name="RF5"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 41  -->
      <edc:VirtualPin edc:name="U1TX"/>
      <edc:VirtualPin edc:name="RF3"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 42  -->
      <edc:VirtualPin edc:name="U1RX"/>
      <edc:VirtualPin edc:name="RF2"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 43  -->
      <edc:VirtualPin edc:name="EMUD3"/>
      <edc:VirtualPin edc:name="SDO1"/>
      <edc:VirtualPin edc:name="RF8"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 44  -->
      <edc:VirtualPin edc:name="SDI1"/>
      <edc:VirtualPin edc:name="RF7"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 45  -->
      <edc:VirtualPin edc:name="EMUC3"/>
      <edc:VirtualPin edc:name="SCK1"/>
      <edc:VirtualPin edc:name="INT0"/>
      <edc:VirtualPin edc:name="RF6"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 46  -->
      <edc:VirtualPin edc:name="SDA"/>
      <edc:VirtualPin edc:name="RG3"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 47  -->
      <edc:VirtualPin edc:name="SCL"/>
      <edc:VirtualPin edc:name="RG2"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 48  -->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 49  -->
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="CLKI"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 50  -->
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="RC15"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 51  -->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 52  -->
      <edc:VirtualPin edc:name="INT3"/>
      <edc:VirtualPin edc:name="RA14"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 53  -->
      <edc:VirtualPin edc:name="INT4"/>
      <edc:VirtualPin edc:name="RA15"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 54  -->
      <edc:VirtualPin edc:name="IC1"/>
      <edc:VirtualPin edc:name="RD8"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 55  -->
      <edc:VirtualPin edc:name="IC2"/>
      <edc:VirtualPin edc:name="RD9"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 56  -->
      <edc:VirtualPin edc:name="IC3"/>
      <edc:VirtualPin edc:name="RD10"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 57  -->
      <edc:VirtualPin edc:name="IC4"/>
      <edc:VirtualPin edc:name="RD11"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 58  -->
      <edc:VirtualPin edc:name="EMUC2"/>
      <edc:VirtualPin edc:name="OC1"/>
      <edc:VirtualPin edc:name="RD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 59  -->
      <edc:VirtualPin edc:name="EMUD1"/>
      <edc:VirtualPin edc:name="SOSCI"/>
      <edc:VirtualPin edc:name="CN1"/>
      <edc:VirtualPin edc:name="RC13"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 60  -->
      <edc:VirtualPin edc:name="EMUC1"/>
      <edc:VirtualPin edc:name="SOSCO"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="CN0"/>
      <edc:VirtualPin edc:name="RC14"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 61  -->
      <edc:VirtualPin edc:name="EMUD2"/>
      <edc:VirtualPin edc:name="OC2"/>
      <edc:VirtualPin edc:name="RD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 62  -->
      <edc:VirtualPin edc:name="OC3"/>
      <edc:VirtualPin edc:name="RD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 63  -->
      <edc:VirtualPin edc:name="OC4"/>
      <edc:VirtualPin edc:name="RD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 64  -->
      <edc:VirtualPin edc:name="IC5"/>
      <edc:VirtualPin edc:name="RD12"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 65  -->
      <edc:VirtualPin edc:name="IC6"/>
      <edc:VirtualPin edc:name="CN19"/>
      <edc:VirtualPin edc:name="RD13"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 66  -->
      <edc:VirtualPin edc:name="OC5"/>
      <edc:VirtualPin edc:name="CN13"/>
      <edc:VirtualPin edc:name="RD4"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 67  -->
      <edc:VirtualPin edc:name="OC6"/>
      <edc:VirtualPin edc:name="CN14"/>
      <edc:VirtualPin edc:name="RD5"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 68  -->
      <edc:VirtualPin edc:name="OC7"/>
      <edc:VirtualPin edc:name="CN15"/>
      <edc:VirtualPin edc:name="RD6"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 69  -->
      <edc:VirtualPin edc:name="OC8"/>
      <edc:VirtualPin edc:name="CN16"/>
      <edc:VirtualPin edc:name="RD7"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 70  -->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 71  -->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 72  -->
      <edc:VirtualPin edc:name="C1RX"/>
      <edc:VirtualPin edc:name="RF0"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 73  -->
      <edc:VirtualPin edc:name="C1TX"/>
      <edc:VirtualPin edc:name="RF1"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 74  -->
      <edc:VirtualPin edc:name="C2TX"/>
      <edc:VirtualPin edc:name="RG1"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 75  -->
      <edc:VirtualPin edc:name="C2RX"/>
      <edc:VirtualPin edc:name="RG0"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 76  -->
      <edc:VirtualPin edc:name="CN22"/>
      <edc:VirtualPin edc:name="RA6"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 77  -->
      <edc:VirtualPin edc:name="CN23"/>
      <edc:VirtualPin edc:name="RA7"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 78  -->
      <edc:VirtualPin edc:name="CSCK"/>
      <edc:VirtualPin edc:name="RG14"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 79  -->
      <edc:VirtualPin edc:name="CSDI"/>
      <edc:VirtualPin edc:name="RG12"/>
    </edc:Pin>
    <edc:Pin>
      <!--  Pin 80  -->
      <edc:VirtualPin edc:name="CSDO"/>
      <edc:VirtualPin edc:name="RG13"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
